namespace SkillRebalanceExpansionMod.Models.Item
{
    // 物品类型，对应type
    public enum Type
    {
        武器 = 0,
        衣服 = 1,
        饰品 = 2,
        技能书 = 3,
        功法书 = 4,
        丹药 = 5,
        药材 = 6,
        任务 = 7,
        矿石 = 8,
        丹炉 = 9,
        丹方 = 10,
        药渣 = 11,
        书籍 = 12,
        书籍_需要时间 = 13,
        灵舟 = 14,
        秘药 = 15,
        其它 = 16
    }

    // 物品图鉴类型，对应TuJianType
    public enum TuJianType
    {
        其它 = 0,
        草药 = 1,
        矿物 = 2,
        妖兽材料 = 3,
        丹药 = 4
    }

    // 商店类型，对应ShopType
    public enum ShopType
    {
        坊市技能书 = 4,
        坊市功法 = 5,
        拍卖秘籍 = 10,
        秘市秘籍 = 14,
        双修秘术 = 19,
        无尽之海拍卖秘籍 = 20,
        宁州天阶拍卖秘籍 = 23,
        无尽之海天阶拍卖秘籍 = 24,
        结丹秘术 = 25,
        结婴秘术 = 26,
        任务物品 = 70,
        拍卖会专属稀有 = 80,
        不投放 = 99
    }

    // 物品标签，对应ItemFlag
    public enum ItemFlag
    {
        神通秘籍 = 4,
        功法秘籍 = 5,

        人阶神通 = 401,
        地阶神通 = 402,
        天阶神通 = 403,

        人阶功法 = 501,
        地阶功法 = 502,
        天阶功法 = 503,

        人阶金系神通 = 4011,
        人阶木系神通 = 4012,
        人阶水系神通 = 4013,
        人阶火系神通 = 4014,
        人阶土系神通 = 4015,
        人阶剑系神通 = 4016,
        人阶神识类神通 = 4017,
        人阶阵法类神通 = 4018,
        人阶神通杂学 = 4019,

        地阶金系神通 = 4021,
        地阶木系神通 = 4022,
        地阶水系神通 = 4023,
        地阶火系神通 = 4024,
        地阶土系神通 = 4025,
        地阶剑系神通 = 4026,
        地阶神识类神通 = 4027,
        地阶阵法类神通 = 4028,
        地阶神通杂学 = 4029,

        天阶金系神通 = 4031,
        天阶木系神通 = 4032,
        天阶水系神通 = 4033,
        天阶火系神通 = 4034,
        天阶土系神通 = 4035,
        天阶剑系神通 = 4036,
        天阶神识类神通 = 4037,
        天阶阵法类神通 = 4038,
        天阶神通杂学 = 4039,

        人阶金系功法 = 5011,
        人阶木系功法 = 5012,
        人阶水系功法 = 5013,
        人阶火系功法 = 5014,
        人阶土系功法 = 5015,
        人阶功法杂学 = 5016,
        人阶遁术 = 5017,

        地阶金系功法 = 5021,
        地阶木系功法 = 5022,
        地阶水系功法 = 5023,
        地阶火系功法 = 5024,
        地阶土系功法 = 5025,
        地阶功法杂学 = 5026,
        地阶遁术 = 5027,

        天阶金系功法 = 5031,
        天阶木系功法 = 5032,
        天阶水系功法 = 5033,
        天阶火系功法 = 5034,
        天阶土系功法 = 5035,
        天阶功法杂学 = 5036,
        天阶遁术 = 5037
    }

    // 悟道大道种类，用于wuDao的数据编写
    public enum DaoType
    {
        金 = 1,
        木 = 2,
        水 = 3,
        火 = 4,
        土 = 5,
        神 = 6,
        体 = 7,
        剑 = 8,
        气 = 9
    }

    // 悟道水平，用于wuDao的数据编写
    public enum DaoLevel
    {
        无 = 0,
        初窥门径 = 1,
        略有小成 = 2,
        融会贯通 = 3,
        道之真境 = 4,
        大道已成 = 5
    }

    // 用于标识Info是功法还是神通的
    public enum BookType
    {
        功法,
        神通
    }
}